--[[

	Powered By :
		 _____       _  ____
		| ____|_ __ (_)/ ___|_ __ ___   __ _ TM
		|  _| | '_ \| | |  _| '_ ` _ \ / _` |
		| |___| | | | | |_| | | | | | | (_| |
		|_____|_| |_|_|\____|_| |_| |_|\__,_|
	
	****************************
	*  >> By : Reza Mehdipour  *
	*  > Channel : @EnigmaTM   *
	****************************
	
]]

HelpListUtilNow = [[
💠<b>/add</b> اضافه کردن گروه به لیست گروه های مدیریت شده

💠<b>/rem</b>  حذف گروه از لیست گروه های مدیریت شده

💠<b>/admins</b>  نمایش ادمین های گروه

💠<b>/gpinfo</b>  نمایش اطلاعات اصلی گروه

💠<b>/modlist</b>  نمایش لیست مدیران فرعی ربات در گروه

💠<b>/bots</b>  نمایش لیست ربات های معمولی موجود در گروه

💠<b>/owner</b> نمایش آیدی مدیر اصلی(اونر) ربات در گروه

💠<b>/filter</b> [word]  فیلتر کردن یک کلمه یا عبارت

💠<b>/rf [word]</b> رفع فیلتر یک کلمه یا عبارت فیلتر شده

💠<b>/filterlist</b> نمایش لیست کلمات فیلتر شده

💠<b>/del</b> {Reply}  حذف یک پیام در گروه با استفاده از ریپلای

💠<b>/setlink</b> تنظیم لینک

💠<b>/link</b> دریافت لینک

💠<b>/setowner</b>  تنظیم مدیر اصلی

💠<b>/promote</b>  ترفیع یک کاربر به عنوان مدیر فرعی ربات

💠<b>/demote</b>  عزل یک مدیر فرعی به یک کاربر عادی

💠<b>/clean [filterlist/silentlist/owner/gbanlist/banlist/modlist/deleted/bots]</b> پاکسازی سایلنت لیست و... 

💠<b>/lock [link/forward/bot/inline/cmd/english/spam/flood/persian/tg/strict/chat]</b> قفل لینک وفوروارد و... 

💠<b>/me</b> اطلاعات کاربر 

💠<b>/ban</b> بن با ریپلی

💠<b>/unban</b> آن بن با آیدی

💠<b>/banall</b> مسدودیت کامل 

💠<b>/unbanall</b> بازکردن مسدودیت کامل

💠<b>/silent</b> سایلنت با ریپلی

💠<b>/kick</b> اخراج با ریپلی

💠<b>/id</b> آیدی کاربر

💠<b>/idfrom</b> آیدی پیام فوروارد شده

💠<b>/banlist</b> بن لیست

💠<b>/gbanlist</b> لیست مسدودیت کامل

💠<b>/silentlist</b> سایلنت لیست

💠<b>/setflood [num]</b> تنظیم فلود

💠<b>/settings</b> تنظیمات

🔱 [~ <i>TAHA</i> ~] 🔱

LocksHelp = [[
📝 راهنمای قفل های بات :

✅ = فعال کردن
❌ = غیرفعال کردن

━━━ 🔐 قفل های اصلی ⏬ ━━━

🔗 جلوگیری از ارسال لینک :

✅ قفل لینک
❌ بازکردن لینک
━━━━━━━━━━
➡️ قفل فروارد :

✅ قفل فروارد
❌ بازکردن فروارد
━━━━━━━━━━
⌨ حذف کیبورد (دکمه) های شیشه ای :

✅ قفل کیبورد
❌ بازکردن کیبورد
━━━━━━━━━━
🖥  پاسخ ندادن بات به کاربران عادی در گروه :

✅ قفل دستورات
❌ بازکردن دستورات
━━━━━━━━━━
🔶 حذف پیام های انگلیسی :

✅ قفل انگلیسی
❌ بازکردن انگلیسی
━━━━━━━━━━
🔷 حذف پیام های فارسی و عربی :

✅ قفل فارسی
❌ بازکردن فارسی
━━━━━━━━━━
🔖 حذف پیام های طولانی :

✅ قفل اسپم
❌ بازکردن اسپم
━━━━━━━━━━
☠ اخراج کاربری که در گروه پیام رگباری ارسال کند :

✅ قفل رگباری
❌ بازکردن رگباری

🔧تنظیم حساسیت پیام های رگباری (مکرر) :

⚜ تنظیم اسپم 7
» به جای 7 میتوانید اعداد 5 تا 20 را قرار دهید.

━━━━━━━━━━
🤖 اخراج ربات هایی که وارد گروه میشوند :

✅ قفل ربات
❌ بازکردن ربات
━━━━━━━━━━
💼 حذف پیام ورود و خروج کاربران از گروه :

✅ قفل خدمات
❌ بازکردن خدمات

━━━ 🗂 قفل های رسانه ای ⏬ ━━━

🔊 حذف صدا و ویس ارسالی در گروه :

✅ قفل صدا
❌ بازکردن صدا
━━━━━━━━━━  
🌅 حدف تصاویر ارسالی :

✅ قفل عکس
❌ بازکردن عکس
━━━━━━━━━━
🎥 حذف ویدیو ارسالی :

✅ قفل ویدیو
❌ بازکردن ویدیو
━━━━━━━━━━
📥 حذف فایل های ارسالی :

✅ قفل فایل
❌ بازکردن فایل
━━━━━━━━━━
📋 حذف متنی که به تنهایی ارسال میشود :

✅ قفل متن
❌ بازکردن متن
━━━━━━━━━━
☂ حذف گیف (عکس متحرک) ارسالی :

✅ قفل گیف
❌ بازکردن گیف
━━━━━━━━━━
🚏حذف استیکر های ارسالی :

✅ قفل استیکر
❌ بازکردن استیکر
━━━━━━━━━━
📍قفل ارسال مخاطب (Share Contact) :

✅ قفل مخاطب
❌ بازکردن مخاطب

━━━━ 💢 قفل های مهم ━━━━

♨️ اخراج کاربری که در گروه لینکی ارسال کند :

✅ قفل سخت
❌ بازکردن سخت
━━━━━━━━━━
🚫 حذف تمامی پیام های ارسالی در گروه (بستن چت) :

✅ قفل چت
❌ بازکردن چت

━━━━━━━━━━
🛠 نمایش تنظیمات گروه :

⚜ تنظیمات
━━━━━━━━━━━━━━━━━━
    🔱 [~ <b>EniGma</b>™ ~] 🔱
     » [ @EnigmaTM ] «
]]

FilterHelp = [[
✅ آموزش فیلتر کلمات :
ا➖➖➖➖

💡بار فیلتر کردن یک کلمه ، بات در صورت مشاهده ی اون کلمه در یک متن ، اون متن رو حذف خواهد کرد.

ا➖➖➖➖
👈 دستورات قسمت فیلتر :

➕ فیلتر کردن یک کلمه :
فیلتر کلمه

➖ رفع فیلتر یک کلمه :
رفع فیلتر کلمه

📝 دریافت لیست کلمات فیلتر شده :
لیست فیلتر

❌ حذف کل کلمات فیلتر شده :
پاکسازی لیست فیلتر
ا➖➖➖➖

➕ مثال فیلتر کردن یک کلمه :
فیلتر احمق

» در اینجا عبارت "احمق" فیلتر خواهد شد.

➖ مثال رفع فیلتر یک کلمه :
رفع فیلتر احمق

» در این قسمت عبارت "احمق" رفع فیلتر خواهد شد.
➖➖➖➖
    🔱 [~ <b>EniGma</b>™ ~] 🔱
     » [ @EnigmaTM ] «
]]


GroupInformationHelp = [[
✅ راهنمای دریافت اطلاعات :
ا➖➖➖➖
👈 دستور دریافت اطلاعات کلی درباره ی خود :
اطلاعات

👈 دستور دریافت اطلاعات کلی گروه :
اطلاعات گروه

👈 دستور دریافت لیست ادمین های گروه :
ادمین ها

👈 دستور دریافت لیست مدیران فرعی بات در گروه :
مدیران فرعی

👈 دستور دریافت لیست بات های API موجود در گروه :
ربات ها

👈 دستور دریافت آیدی مدیر اصلی بات در گروه :
مدیر اصلی
ا➖➖➖➖
📎 کار با لینک در گروه :

🔅دستور تنظیم لینک در گروه :
تنظیم لینک

🔅دستور دریافت لینک گروه :
لینک

➖➖➖➖
    🔱 [~ <b>EniGma</b>™ ~] 🔱
     » [ @EnigmaTM ] «
]]


local function run(msg,matches)

	------- LOCK CMD
	data = load_data(_config.moderation.data)
	if data[tostring(msg.to.id)] then
		if data[tostring(msg.to.id)]['settings'] then
			if data[tostring(msg.to.id)]['settings']['lock_cmd'] then
				lock_cmd = data[tostring(msg.to.id)]['settings']['lock_cmd']
				if lock_cmd == "yes" and not is_momod(msg) then
					return
				end
			end
		end
	end
	-------
	
	if matches[1] == "راهنما" then
		return reply_msg(msg.id,HelpListUtilNow,ok_cb,false)
	end
	
	if matches[1] == "راهنمای" and matches[2] then
		
		if matches[2] == "قفل ها" then
			return reply_msg(msg.id,LocksHelp,ok_cb,false)
		end
		
		if matches[2] == "فیلتر" then
			return reply_msg(msg.id,FilterHelp,ok_cb,false)
		end
		
		if matches[2] == "اطلاعات" then
			return reply_msg(msg.id,GroupInformationHelp,ok_cb,false)
		end
		
	end -- end matches[1] == "راهنمای"

end	

return {
patterns = {
	"^(راهنما)$",
	"^(راهنمای) (.*)"
},
	run = run
}

--[[

	Powered By :
		 _____       _  ____
		| ____|_ __ (_)/ ___|_ __ ___   __ _ TM
		|  _| | '_ \| | |  _| '_ ` _ \ / _` |
		| |___| | | | | |_| | | | | | | (_| |
		|_____|_| |_|_|\____|_| |_| |_|\__,_|
	
	****************************
	*  >> By : Reza Mehdipour  *
	*  > Channel : @EnigmaTM   *
	****************************
	
]]
